export const BASE_URL = 'https://furniture-store-v2.b.goit.study/api';

export const ENDPOINTS = {
  CATEGORY: '/categories',
  FURNITURE: '/furnitures',
  FEEDBACK: '/feedbacks',
  ORDER: '/orders',
};

export let currentPage = 1;
export const limit = 8;
export let currentCategory = 'all';
export const faqData = [
  {
    q: 'Як здійснюється доставка меблів?',
    a: 'Ми доставляємо замовлення по всій Україні через надійні служби. Термін доставки зазвичай складає 3–7 днів залежно від регіону.',
  },
  {
    q: 'Чи є можливість вибрати колір або матеріал?',
    a: 'Так, у багатьох моделях доступні варіанти оббивки та кольорів. Усі доступні опції вказані на сторінці товару.',
  },
  {
    q: 'Чи можна повернути товар, якщо він не підійшов?',
    a: 'Так, ви можете повернути товар протягом 14 днів, якщо він не був у користуванні та збережений у первинному вигляді.',
  },
  {
    q: 'Чи надаєте ви послугу збирання меблів?',
    a: 'Так, під час оформлення замовлення можна обрати послугу збирання. Наші майстри зберуть меблі у зручний для вас час.',
  },
  {
    q: 'Як здійснити оплату?',
    a: 'Ми приймаємо оплату карткою онлайн, банківським переказом або післяплатою при отриманні.',
  },
];
